{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "activate_my_card",
    "1": "age_limit",
    "2": "apple_pay_or_google_pay",
    "3": "atm_support",
    "4": "automatic_top_up",
    "5": "balance_not_updated_after_bank_transfer",
    "6": "balance_not_updated_after_cheque_or_cash_deposit",
    "7": "beneficiary_not_allowed",
    "8": "cancel_transfer",
    "9": "card_about_to_expire",
    "10": "card_acceptance",
    "11": "card_arrival",
    "12": "card_delivery_estimate",
    "13": "card_linking",
    "14": "card_not_working",
    "15": "card_payment_fee_charged",
    "16": "card_payment_not_recognised",
    "17": "card_payment_wrong_exchange_rate",
    "18": "card_swallowed",
    "19": "cash_withdrawal_charge",
    "20": "cash_withdrawal_not_recognised",
    "21": "change_pin",
    "22": "compromised_card",
    "23": "contactless_not_working",
    "24": "country_support",
    "25": "declined_card_payment",
    "26": "declined_cash_withdrawal",
    "27": "declined_transfer",
    "28": "direct_debit_payment_not_recognised",
    "29": "disposable_card_limits",
    "30": "edit_personal_details",
    "31": "exchange_charge",
    "32": "exchange_rate",
    "33": "exchange_via_app",
    "34": "extra_charge_on_statement",
    "35": "failed_transfer",
    "36": "fiat_currency_support",
    "37": "get_disposable_virtual_card",
    "38": "get_physical_card",
    "39": "getting_spare_card",
    "40": "getting_virtual_card",
    "41": "lost_or_stolen_card",
    "42": "lost_or_stolen_phone",
    "43": "order_physical_card",
    "44": "passcode_forgotten",
    "45": "pending_card_payment",
    "46": "pending_cash_withdrawal",
    "47": "pending_top_up",
    "48": "pending_transfer",
    "49": "pin_blocked",
    "50": "receiving_money",
    "51": "Refund_not_showing_up",
    "52": "request_refund",
    "53": "reverted_card_payment?",
    "54": "supported_cards_and_currencies",
    "55": "terminate_account",
    "56": "top_up_by_bank_transfer_charge",
    "57": "top_up_by_card_charge",
    "58": "top_up_by_cash_or_cheque",
    "59": "top_up_failed",
    "60": "top_up_limits",
    "61": "top_up_reverted",
    "62": "topping_up_by_card",
    "63": "transaction_charged_twice",
    "64": "transfer_fee_charged",
    "65": "transfer_into_account",
    "66": "transfer_not_received_by_recipient",
    "67": "transfer_timing",
    "68": "unable_to_verify_identity",
    "69": "verify_my_identity",
    "70": "verify_source_of_funds",
    "71": "verify_top_up",
    "72": "virtual_card_not_working",
    "73": "visa_or_mastercard",
    "74": "why_verify_identity",
    "75": "wrong_amount_of_cash_received",
    "76": "wrong_exchange_rate_for_cash_withdrawal"
  },
  "initializer_range": 0.02,
  "label2id": {
    "activate_my_card": 0,
    "age_limit": 1,
    "apple_pay_or_google_pay": 2,
    "atm_support": 3,
    "automatic_top_up": 4,
    "balance_not_updated_after_bank_transfer": 5,
    "balance_not_updated_after_cheque_or_cash_deposit": 6,
    "beneficiary_not_allowed": 7,
    "cancel_transfer": 8,
    "card_about_to_expire": 9,
    "card_acceptance": 10,
    "card_arrival": 11,
    "card_delivery_estimate": 12,
    "card_linking": 13,
    "card_not_working": 14,
    "card_payment_fee_charged": 15,
    "card_payment_not_recognised": 16,
    "card_payment_wrong_exchange_rate": 17,
    "card_swallowed": 18,
    "cash_withdrawal_charge": 19,
    "cash_withdrawal_not_recognised": 20,
    "change_pin": 21,
    "compromised_card": 22,
    "contactless_not_working": 23,
    "country_support": 24,
    "declined_card_payment": 25,
    "declined_cash_withdrawal": 26,
    "declined_transfer": 27,
    "direct_debit_payment_not_recognised": 28,
    "disposable_card_limits": 29,
    "edit_personal_details": 30,
    "exchange_charge": 31,
    "exchange_rate": 32,
    "exchange_via_app": 33,
    "extra_charge_on_statement": 34,
    "failed_transfer": 35,
    "fiat_currency_support": 36,
    "get_disposable_virtual_card": 37,
    "get_physical_card": 38,
    "getting_spare_card": 39,
    "getting_virtual_card": 40,
    "lost_or_stolen_card": 41,
    "lost_or_stolen_phone": 42,
    "order_physical_card": 43,
    "passcode_forgotten": 44,
    "pending_card_payment": 45,
    "pending_cash_withdrawal": 46,
    "pending_top_up": 47,
    "pending_transfer": 48,
    "pin_blocked": 49,
    "receiving_money": 50,
    "Refund_not_showing_up": 51,
    "request_refund": 52,
    "reverted_card_payment?": 53,
    "supported_cards_and_currencies": 54,
    "terminate_account": 55,
    "top_up_by_bank_transfer_charge": 56,
    "top_up_by_card_charge": 57,
    "top_up_by_cash_or_cheque": 58,
    "top_up_failed": 59,
    "top_up_limits": 60,
    "top_up_reverted": 61,
    "topping_up_by_card": 62,
    "transaction_charged_twice": 63,
    "transfer_fee_charged": 64,
    "transfer_into_account": 65,
    "transfer_not_received_by_recipient": 66,
    "transfer_timing": 67,
    "unable_to_verify_identity": 68,
    "verify_my_identity": 69,
    "verify_source_of_funds": 70,
    "verify_top_up": 71,
    "virtual_card_not_working": 72,
    "visa_or_mastercard": 73,
    "why_verify_identity": 74,
    "wrong_amount_of_cash_received": 75,
    "wrong_exchange_rate_for_cash_withdrawal": 76
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}